In [4]:
import pandas as pd 
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
import pandas as pd 
pd.Series([1,2,3,4,5],dtype='i4')

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [6]:
import pandas as pd 
minha_serie= pd.Series([1,2,3,4,5],dtype='i4',name="meus numeros",index=["um","dois","três","quatro","cinco"])
print(minha_serie["um"])
print(minha_serie["quatro"])
print(minha_serie["cinco"])

1
4
5

In [7]:
import pandas as pd 
minha_serie= pd.Series([1,2,3,4,5],dtype='i4',name="meus numeros",index=["um","dois","três","quatro","cinco"])
minha_serie['seis'] = 6
print(minha_serie)

um        1
dois      2
três      3
quatro    4
cinco     5
seis      6
Name: meus numeros, dtype: int32

In [8]:
import pandas as pd 
import numpy as np 
array = np.array([45,7,8,65.8,98.7])
pesos = pd.Series(array,index=["Carlos","Bia","Maria","Thamyres","Joao"])
print(pesos)
print(type(pesos))

Carlos      45.0
Bia          7.0
Maria        8.0
Thamyres    65.8
Joao        98.7
dtype: float64
<class 'pandas.core.series.Series'>

In [9]:
import pandas as pd 
data_frame = pd.DataFrame()
data_frame

Empty DataFrame
Columns: []
Index: []

In [10]:
import pandas as pd 
nomes =['Roger','Lucas','Renata','Maria']
data_frame = pd.DataFrame(nomes)
data_frame

        0
0   Roger
1   Lucas
2  Renata
3   Maria

In [11]:
print(data_frame)

        0
0   Roger
1   Lucas
2  Renata
3   Maria

In [12]:
import pandas as pd 
numeros = [
        ['11','22','33','44'],
        ['11','22','33','44'],
        ['11','22','33','44'],
        ['11','22','33','44']
]
data_frame = pd.DataFrame(numeros,columns=['a','b','c','d'])
data_frame

    a   b   c   d
0  11  22  33  44
1  11  22  33  44
2  11  22  33  44
3  11  22  33  44

In [13]:
import pandas as pd 
dados = {
    'Nome':['Roger','Cristiano','Diego','Carla'],
    'Idade':[45,55,30,25],
    'Profissão':['Engenheiro de dados','Analista BI','Analista de Dados','Cientista de Dados']

}
data_frame = pd.DataFrame(dados)
data_frame

        Nome  Idade            Profissão
0      Roger     45  Engenheiro de dados
1  Cristiano     55          Analista BI
2      Diego     30    Analista de Dados
3      Carla     25   Cientista de Dados

In [14]:
import pandas as pd 
dados = {
    'Idade':[45,55,30,25],
    'Profissão':['Engenheiro de dados','Analista BI','Analista de Dados','Cientista de Dados']

}
data_frame = pd.DataFrame(dados,index=['Roger','Cristiano','Diego','Carla'])
data_frame

           Idade            Profissão
Roger         45  Engenheiro de dados
Cristiano     55          Analista BI
Diego         30    Analista de Dados
Carla         25   Cientista de Dados

In [15]:
data_frame.loc['Roger']

Idade                         45
Profissão    Engenheiro de dados
Name: Roger, dtype: object

In [16]:
data_frame.loc['Carla']

Idade                        25
Profissão    Cientista de Dados
Name: Carla, dtype: object

In [17]:
import pandas as pd 
data = pd.read_csv('pessoas.csv',index_col='nome')
data

        id   profissao
nome
Maria    1  Professora
Joao     2      Medico
Ryan     3  Engenheiro
Robert   4    Advogado

In [18]:
len(data.columns)

2

In [19]:
data.columns

Index(['id', 'profissao'], dtype='object')

In [20]:
len(data.index)

4

In [21]:
data.index

Index(['Maria', 'Joao', 'Ryan', 'Robert'], dtype='object', name='nome')

In [22]:
data.shape

(4, 2)

In [23]:
for indice,linha in data.iterrows():
    print(indice,linha[0],linha[1])

Maria 1 Professora
Joao 2 Medico
Ryan 3 Engenheiro
Robert 4 Advogado

C:\Users\walla\AppData\Local\Temp\ipykernel_57392\3387270415.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(indice,linha[0],linha[1])

In [24]:
for coluna in data:
    print(data[coluna])

nome
Maria     1
Joao      2
Ryan      3
Robert    4
Name: id, dtype: int64
nome
Maria     Professora
Joao          Medico
Ryan      Engenheiro
Robert      Advogado
Name: profissao, dtype: object

In [25]:
data

        id   profissao
nome
Maria    1  Professora
Joao     2      Medico
Ryan     3  Engenheiro
Robert   4    Advogado

In [26]:
print(data.loc['Maria']['profissao'])

Professora

In [27]:
print(data.loc['Maria'])

id                    1
profissao    Professora
Name: Maria, dtype: object

In [28]:
print(data.iloc[0])

id                    1
profissao    Professora
Name: Maria, dtype: object

In [29]:
print(data.iloc[1])

id                2
profissao    Medico
Name: Joao, dtype: object

In [30]:
data.iloc[1:3]

      id   profissao
nome
Joao   2      Medico
Ryan   3  Engenheiro

In [31]:
print(data['profissao'])

nome
Maria     Professora
Joao          Medico
Ryan      Engenheiro
Robert      Advogado
Name: profissao, dtype: object

In [32]:
profissao = data['profissao']
print(profissao[0])

Professora

C:\Users\walla\AppData\Local\Temp\ipykernel_57392\3605541610.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(profissao[0])

In [33]:
data

        id   profissao
nome
Maria    1  Professora
Joao     2      Medico
Ryan     3  Engenheiro
Robert   4    Advogado

In [34]:
colunas = data.iloc[:,1:3]
colunas

         profissao
nome
Maria   Professora
Joao        Medico
Ryan    Engenheiro
Robert    Advogado

In [35]:
colunas = data.loc[:,"nome":"profissao"]
colunas

         profissao
nome
Maria   Professora
Joao        Medico
Ryan    Engenheiro
Robert    Advogado

In [36]:
data_adicional = pd.DataFrame({'Idade':[34,21,54],
                                'Profissao':['Paraquedista','Professor','Advogado'],
                                'Altura':[180.0,181.0,182.0]},
                                index=['Robert','Richard','Chad'])

data_adicional.index.name = 'Nones'
data_adicional

         Idade     Profissao  Altura
Nones
Robert      34  Paraquedista   180.0
Richard     21     Professor   181.0
Chad        54      Advogado   182.0

In [37]:
import pandas as pd 
df = pd.read_csv('pessoas.csv')
df

   id    nome   profissao
0   1   Maria  Professora
1   2    Joao      Medico
2   3    Ryan  Engenheiro
3   4  Robert    Advogado

In [39]:
pd.isnull(data_adicional)

         Idade  Profissao  Altura
Nones
Robert   False      False   False
Richard  False      False   False
Chad     False      False   False

In [41]:
data_adicional.notnull()

         Idade  Profissao  Altura
Nones
Robert    True       True    True
Richard   True       True    True
Chad      True       True    True

In [42]:
mask = pd.notnull(data_adicional['Idade'])
mask

Nones
Robert     True
Richard    True
Chad       True
Name: Idade, dtype: bool

In [43]:
data_adicional[mask]

         Idade     Profissao  Altura
Nones
Robert      34  Paraquedista   180.0
Richard     21     Professor   181.0
Chad        54      Advogado   182.0

In [45]:
copy = data_adicional.sort_values('Idade',ascending=True,inplace=False)
copy

         Idade     Profissao  Altura
Nones
Richard     21     Professor   181.0
Robert      34  Paraquedista   180.0
Chad        54      Advogado   182.0

In [48]:
copy = data_adicional.sort_values('Idade',ascending=True,inplace=False,na_position='first')
copy

         Idade     Profissao  Altura
Nones
Richard     21     Professor   181.0
Robert      34  Paraquedista   180.0
Chad        54      Advogado   182.0

In [49]:
data_adicional.loc['Chad','Idade'] = 34 
data_adicional

         Idade     Profissao  Altura
Nones
Robert      34  Paraquedista   180.0
Richard     21     Professor   181.0
Chad        34      Advogado   182.0

In [50]:
copy = data_adicional.sort_values(['Idade','Altura'],ascending=True,inplace=False,na_position='first')
copy

         Idade     Profissao  Altura
Nones
Richard     21     Professor   181.0
Robert      34  Paraquedista   180.0
Chad        34      Advogado   182.0